# ============================================
# LEVEL 2: PARSON PROBLEMS (ADVANCED)
# ============================================
# Соберите программу из перепутанных строк кода!
# Время выполнения: 40-50 минут
# ============================================

"""
🧩 PARSON PROBLEMS ДЛЯ ПРОДВИНУТОГО УРОВНЯ

Уровень 2 — самые сложные задачи:
✅ Функции с return
✅ Словари
✅ Рекурсия
✅ Комплексная логика

Те же правила:
- Перепутанные строки
- Отвлекающие (неправильные) строки
- Нужно расставить в правильном порядке
"""

print("="*60)
print("ЗАДАЧА 1: ФУНКЦИЯ ФАКТОРИАЛА")
print("="*60)

print("""
🎯 ЦЕЛЬ: Рекурсивная функция вычисления факториала

Ожидаемый результат:
- factorial(5) → 120 (5*4*3*2*1)
- factorial(3) → 6 (3*2*1)
- factorial(1) → 1

📋 ПЕРЕПУТАННЫЕ СТРОКИ:

A) def factorial(n):
B) def factorial(n, result):
C)     if n <= 1:
D)         return 1
E)         return n
F)     else:
G)     return n * factorial(n - 1)
H)     return n + factorial(n - 1)
I) print(factorial(5))

🔢 ИНСТРУКЦИЯ:
1. Строка B — НЕПРАВИЛЬНАЯ (не нужен второй параметр)
2. Строка E — НЕПРАВИЛЬНАЯ (должно быть 1, не n)
3. Строка H — НЕПРАВИЛЬНАЯ (умножение, не сложение!)
4. Строка F (else) — опциональна, можно без неё

💡 ПОДСКАЗКА:
- Базовый случай: n <= 1 возвращает 1
- Рекурсивный: n * factorial(n - 1)
- Найдите правильную последовательность строк!
""")

print("\n--- Ваше решение (задание 1) ---")
# Напишите правильный код:




print("\n" + "="*60)
print("ЗАДАЧА 2: ПОИСК В СЛОВАРЕ")
print("="*60)

print("""
📋 ПЕРЕПУТАННЫЕ СТРОКИ:

A) students = {"Алиса": 85, "Боб": 92, "Ева": 78}
B) max_score = 0
C) max_score = -1
D) best_student = ""
E) for name, score in students.items():
F) for name in students:
G)     if score > max_score:
H)         max_score = score
I)         best_student = name
J) print(f"Лучший студент: {best_student} с баллом {max_score}")
K) print("Лучший студент:", best_student, max_score)

🎯 ОЖИДАЕМЫЙ РЕЗУЛЬТАТ:
Лучший студент: Боб с баллом 92
""")

print("\n--- Ваше решение (задание 2) ---")
# Напишите правильный код:




print("\n" + "="*60)
print("ЗАДАЧА 3: ФУНКЦИЯ ФИБОНАЧЧИ")
print("="*60)

print("""
📋 ПЕРЕПУТАННЫЕ СТРОКИ:

A) def fibonacci(n):
B)     if n <= 0:
C)         return 0
D)     elif n == 1:
E)         return 1
F)     else:
G)     return fibonacci(n - 1) + fibonacci(n - 2)
H)     return n * fibonacci(n - 1)
I) if n < 2:
J)     return n

print(fibonacci(0))
print(fibonacci(1))
print(fibonacci(5))
print(fibonacci(7))

🎯 ОЖИДАЕМЫЙ РЕЗУЛЬТАТ:
0
1
5
13
""")

print("\n--- Ваше решение (задание 3) ---")
# Напишите правильный код:




print("\n" + "="*60)
print("ЗАДАЧА 4: СОЗДАНИЕ СЛОВАРЯ ИЗ СПИСКОВ")
print("="*60)

print("""
📋 ПЕРЕПУТАННЫЕ СТРОКИ:

A) keys = ["имя", "возраст", "город"]
B) values = ["Алиса", 15, "Москва"]
C) result = {}
D) result = []
E) for i in range(len(keys)):
F) for key, value in zip(keys, values):
G)     result[keys[i]] = values[i]
H)     result[key] = value
I)     result.append((keys[i], values[i]))
J) print(result)

🎯 ОЖИДАЕМЫЙ РЕЗУЛЬТАТ:
{'имя': 'Алиса', 'возраст': 15, 'город': 'Москва'}
""")

print("\n--- Ваше решение (задание 4) ---")
# Напишите правильный код:




print("\n" + "="*60)
print("ЗАДАЧА 5: ФУНКЦИЯ С СЛОВАРЁМ (ИНВЕРТИРОВАНИЕ)")
print("="*60)

print("""
📋 ПЕРЕПУТАННЫЕ СТРОКИ:

A) def invert_dict(d):
B)     result = {}
C)     result = []
D)     for key, value in d.items():
E)     for key in d:
F)         result[value] = key
G)         result[key] = value
H)     return result
I) original = {"a": 1, "b": 2, "c": 3}
J) inverted = invert_dict(original)
K) print(inverted)

🎯 ОЖИДАЕМЫЙ РЕЗУЛЬТАТ:
{1: 'a', 2: 'b', 3: 'c'}
""")

print("\n--- Ваше решение (задание 5) ---")
# Напишите правильный код:




print("\n" + "="*60)
print("ЗАДАЧА 6: РЕКУРСИВНЫЙ ПОИСК СУММЫ")
print("="*60)

print("""
📋 ПЕРЕПУТАННЫЕ СТРОКИ:

A) def sum_list(numbers):
B)     if len(numbers) == 0:
C)         return 0
D)     if numbers == []:
E)     else:
F)     return numbers[0] + sum_list(numbers[1:])
G)     return numbers[0] + sum_list(numbers[:-1])
H) print(sum_list([1, 2, 3, 4, 5]))

🎯 ОЖИДАЕМЫЙ РЕЗУЛЬТАТ:
15
""")

print("\n--- Ваше решение (задание 6) ---")
# Напишите правильный код:




print("\n" + "="*60)
print("ЗАДАЧА 7: ФИЛЬТРАЦИЯ СЛОВАРЯ")
print("="*60)

print("""
📋 ПЕРЕПУТАННЫЕ СТРОКИ:

A) students = {"Алиса": 85, "Боб": 75, "Ева": 90, "Дима": 70}
B) result = {}
C) for name, score in students.items():
D) for name in students.keys():
E)     if score >= 80:
F)         result[name] = score
G) result = {name: score for name, score in students.items() if score >= 80}
H) print(result)

🎯 ОЖИДАЕМЫЙ РЕЗУЛЬТАТ:
{'Алиса': 85, 'Ева': 90}
""")

print("\n--- Ваше решение (задание 7) ---")
# Напишите правильный код:




# ============================================
# БОНУСНОЕ ЗАДАНИЕ (ЭКСТРА-СЛОЖНОЕ!)
# ============================================
print("\n" + "="*60)
print("🏆 БОНУС: ГРУППИРОВКА ПО ПЕРВОЙ БУКВЕ")
print("="*60)

print("""
📋 ПЕРЕПУТАННЫЕ СТРОКИ:

A) words = ["apple", "apricot", "banana", "blueberry", "cherry"]
B) result = {}
C) for word in words:
D)     first_letter = word[0]
E)     first_letter = word[1]
F)     if first_letter not in result:
G)         result[first_letter] = []
H)         result[first_letter] = {}
I)     result[first_letter].append(word)
J)     result[first_letter] = word
K) print(result)

🎯 ОЖИДАЕМЫЙ РЕЗУЛЬТАТ:
{'a': ['apple', 'apricot'], 'b': ['banana', 'blueberry'], 'c': ['cherry']}
""")

print("\n--- Ваше решение (бонус) ---")
# Напишите правильный код:




# ============================================
# СОЗДАЙТЕ СВОЮ PARSON PROBLEM!
# ============================================
print("\n" + "="*60)
print("🎨 ТВОРЧЕСКОЕ ЗАДАНИЕ")
print("="*60)

print("""
Создайте СВОЮ Parson Problem уровня 2!

Требования:
1. Должна использовать функции ИЛИ словари ИЛИ рекурсию
2. 8-12 строк кода
3. 3-4 отвлекающие строки
4. Чёткое описание задачи

Идеи:
- Функция сортировки (пузырьковая)
- Поиск дубликатов в списке
- Слияние двух словарей
- Рекурсивный обход вложенного списка
- Подсчёт символов в строке (словарь)

Обменяйтесь с одноклассником — пусть попробует решить!
""")

print("\n--- Ваша Parson Problem ---")
# Напишите задачу:




# ============================================
# ПРОВЕРКА НАВЫКОВ
# ============================================
print("\n" + "="*60)
print("✅ ЧТО ВЫ ПРАКТИКОВАЛИ")
print("="*60)

print("""
После Parson Problems Level 2 вы должны:

✅ Понимать структуру рекурсивных функций
✅ Работать со словарями (создание, перебор, фильтрация)
✅ Видеть разницу между правильными и неправильными вариантами
✅ Понимать базовые и рекурсивные случаи
✅ Использовать .items(), .keys(), .values()
✅ Понимать индексацию и срезы списков
✅ Знать продвинутые техники (zip, dict comprehension)

💡 СЛЕДУЮЩИЙ ШАГ:
- test_driven_level2.py (TDD задачи)
- olympiad_problems.py (олимпиадные задачи)
- Или попробуйте JS/C++ версии!
""")

print("\n" + "="*60)
print("🎉 PARSON PROBLEMS LEVEL 2 ЗАВЕРШЕНЫ!")
print("="*60)
print("\n📍 Следующий шаг: test_driven_level2.py или olympiad_problems.py")
